projects/results/test_varnish_lbal_apache_with_apc_memcache_session.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking drupaltest.local (be patient).....done


Server Software:        nginx/1.2.8
Server Hostname:        drupaltest.local
Server Port:            80

Document Path:          /mankind_in_need
Document Length:        13260 bytes

Concurrency Level:      10
Time taken for tests:   5.629 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      1382600 bytes
HTML transferred:       1326000 bytes
Requests per second:    17.76 [#/sec] (mean)
Time per request:       562.929 [ms] (mean)
Time per request:       56.293 [ms] (mean, across all concurrent requests)
Transfer rate:          239.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   13  59.4      0     302
Processing:   147  536 231.0    548     989
Waiting:      147  536 231.0    547     988
Total:        147  549 242.7    631    1079

Percentage of the requests served within a certain time (ms)
  50%    631
  66%    733
  75%    752
  80%    765
  90%    793
  95%    955
  98%   1077
  99%   1079
 100%   1079 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking drupaltest.local (be patient).....done


Server Software:        nginx/1.2.8
Server Hostname:        drupaltest.local
Server Port:            80

Document Path:          /mankind_in_need
Document Length:        13260 bytes

Concurrency Level:      10
Time taken for tests:   5.764 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      1382600 bytes
HTML transferred:       1326000 bytes
Requests per second:    17.35 [#/sec] (mean)
Time per request:       576.423 [ms] (mean)
Time per request:       57.642 [ms] (mean, across all concurrent requests)
Transfer rate:          234.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   3.8      0      38
Processing:   124  563 285.3    588    1146
Waiting:      124  562 285.4    588    1146
Total:        124  563 284.8    590    1146

Percentage of the requests served within a certain time (ms)
  50%    590
  66%    741
  75%    803
  80%    824
  90%    895
  95%   1073
  98%   1141
  99%   1146
 100%   1146 (longest request)


Concurrency 20
===============

This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking drupaltest.local (be patient).....done


Server Software:        nginx/1.2.8
Server Hostname:        drupaltest.local
Server Port:            80

Document Path:          /mankind_in_need
Document Length:        13260 bytes

Concurrency Level:      20
Time taken for tests:   5.456 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      1382600 bytes
HTML transferred:       1326000 bytes
Requests per second:    18.33 [#/sec] (mean)
Time per request:       1091.155 [ms] (mean)
Time per request:       54.558 [ms] (mean, across all concurrent requests)
Transfer rate:          247.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.4      0      14
Processing:   162 1048 231.7   1050    1720
Waiting:      162 1048 231.7   1049    1719
Total:        163 1049 231.7   1050    1720

Percentage of the requests served within a certain time (ms)
  50%   1050
  66%   1090
  75%   1141
  80%   1175
  90%   1317
  95%   1459
  98%   1485
  99%   1720
 100%   1720 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking drupaltest.local (be patient).....done


Server Software:        nginx/1.2.8
Server Hostname:        drupaltest.local
Server Port:            80

Document Path:          /mankind_in_need
Document Length:        13260 bytes

Concurrency Level:      20
Time taken for tests:   5.740 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      1382600 bytes
HTML transferred:       1326000 bytes
Requests per second:    17.42 [#/sec] (mean)
Time per request:       1147.963 [ms] (mean)
Time per request:       57.398 [ms] (mean, across all concurrent requests)
Transfer rate:          235.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   19  72.3      0     303
Processing:   332 1077 314.2    992    1666
Waiting:      332 1077 314.2    992    1666
Total:        332 1097 327.4   1005    1678

Percentage of the requests served within a certain time (ms)
  50%   1005
  66%   1379
  75%   1425
  80%   1438
  90%   1481
  95%   1556
  98%   1666
  99%   1678
 100%   1678 (longest request)


Concurrency 30
================

This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking drupaltest.local (be patient).....done


Server Software:        nginx/1.2.8
Server Hostname:        drupaltest.local
Server Port:            80

Document Path:          /mankind_in_need
Document Length:        13260 bytes

Concurrency Level:      30
Time taken for tests:   6.287 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      1382600 bytes
HTML transferred:       1326000 bytes
Requests per second:    15.91 [#/sec] (mean)
Time per request:       1886.159 [ms] (mean)
Time per request:       62.872 [ms] (mean, across all concurrent requests)
Transfer rate:          214.75 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   16  65.9      1     302
Processing:   154 1746 472.3   1844    2921
Waiting:      154 1745 472.2   1844    2921
Total:        156 1762 483.1   1883    2921

Percentage of the requests served within a certain time (ms)
  50%   1883
  66%   2072
  75%   2146
  80%   2165
  90%   2302
  95%   2445
  98%   2664
  99%   2921
 100%   2921 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking drupaltest.local (be patient).....done


Server Software:        nginx/1.2.8
Server Hostname:        drupaltest.local
Server Port:            80

Document Path:          /mankind_in_need
Document Length:        13260 bytes

Concurrency Level:      30
Time taken for tests:   5.817 seconds
Complete requests:      100
Failed requests:        0
Write errors:           0
Total transferred:      1382600 bytes
HTML transferred:       1326000 bytes
Requests per second:    17.19 [#/sec] (mean)
Time per request:       1745.152 [ms] (mean)
Time per request:       58.172 [ms] (mean, across all concurrent requests)
Transfer rate:          232.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   25  82.1      0     302
Processing:   676 1620 324.0   1623    2387
Waiting:      676 1619 324.0   1623    2387
Total:        676 1644 348.9   1650    2419

Percentage of the requests served within a certain time (ms)
  50%   1650
  66%   1810
  75%   1869
  80%   1935
  90%   2081
  95%   2251
  98%   2388
  99%   2419
 100%   2419 (longest request)